УчетВУправляющихДляГит1/src/InformationRegisters/СертификатыОрганизацийДляОбменаСБанками/СертификатыОрганизацийДляОбменаСБанками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СертификатыОрганизацийДляОбменаСБанками</name>
  <resources>
    <name>СертификатОтпечаток</name>
    <type>
      <types>DefinedType.ОтпечатокСертификатаДляОбменаСБанками</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сервис</name>
    <type>
      <types>EnumRef.СервисыОбменаСБанками</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УчетВУправляющихДляГит1/src/InformationRegisters/СертификатыОрганизацийДляОбменаСБанками/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ВыбратьСертификат(Команда)
	
	Оповещение = Новый ОписаниеОповещения(
		"ПослеВводаПараметровКриптографии",
		ЭтотОбъект);
		
	ПараметрыОтбора = УниверсальныйОбменСБанкамиКлиентСервер.
		ПараметрыОтбораСертификата(Запись.Сервис, Запись.Организация);
	ПараметрыОтбора.ПредставлениеОтбора = СтрШаблон(НСтр("ru='Организация = ""%1""'"), Запись.Организация);
		
	Если НЕ ФильтроватьПоРеквизитам Тогда
		ПараметрыОтбора = Неопределено;
	КонецЕсли;
		
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Сервис", Запись.Сервис);
	ПараметрыФормы.Вставить("Организация", Запись.Организация);
	ПараметрыФормы.Вставить("ОтображатьПолеВводаПароля", Ложь);
	ПараметрыФормы.Вставить("НазваниеКнопки", "Сохранить");
	ПараметрыФормы.Вставить("Заголовок", "Выберите сертификат");
	ПараметрыФормы.Вставить("ПараметрыОтбора", ПараметрыОтбора);
	
	ОткрытьФорму("ОбщаяФорма.ВводПараметровКриптографииОбменаСБанками", 
		ПараметрыФормы,
		ЭтаФорма,
		,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаПараметровКриптографии(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Запись.СертификатОтпечаток                  = Результат.Сертификат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСертификат(Команда)
	
	ПараметрыОтбора = УниверсальныйОбменСБанкамиКлиентСервер.
		ПараметрыОтбораСертификата(Запись.Сервис, Запись.Организация);
		
	Оповещение = Новый ОписаниеОповещения("ПодобратьСертификатПослеПодбора", ЭтотОбъект);
	УниверсальныйОбменСБанкамиКлиент.
		ПодобратьСертификатОрганизации(ПараметрыОтбора, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьСертификатПослеПодбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Выполнено Тогда
		Запись.СертификатОтпечаток = Результат.ОтпечатокСертификата;
	КонецЕсли;
	
КонецПроцедуры
